### Terraform Plan: `nrds` ✅

**Plan: 25 to add, 0 to change, 0 to destroy.**

<details><summary>Show Plan Details</summary>

```terraform
                                        ]
                                    },
                                  + {
                                      + ResourceType = "volume"
                                      + Tags         = [
                                          + {
                                              + Key   = "Name"
                                              + Value = "prod_routing_only_short_range_VPU03W_init21_vol"
                                            },
                                        ]
                                    },
                                ]
                            }
                          + run_options         = {
                              + ii_cheapo             = true
                              + ii_check_s3           = true
                              + ii_delete_volume      = true
                              + ii_terminate_instance = true
                              + n_retries_allowed     = 2
                              + timeout_s             = 3600
                            }
                        }
                    )
                  + Name            = "routing_only_short_range_vpu03W_init21_<aws.scheduler.execution-id>"
                  + StateMachineArn = "arn:aws:states:us-east-1:879381264451:stateMachine:nrds_prod_sm"
                }
            )
          + role_arn = "arn:aws:iam::879381264451:role/nrds_prod_scheduler_role"
        }
    }

  # module.routing_only_schedules.aws_scheduler_schedule.datastream_schedule_short_range_routing_only["22_03W"] will be created
  + resource "aws_scheduler_schedule" "datastream_schedule_short_range_routing_only" {
      + arn                          = (known after apply)
      + group_name                   = "default"
      + id                           = (known after apply)
      + name                         = "short_range_fcst22_vpu03W_schedule_routing_only_prod"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 23 * * ? *)"
      + schedule_expression_timezone = "America/New_York"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:sfn:startExecution"
          + input    = jsonencode(
                {
                  + Input           = jsonencode(
                        {
                          + commands            = [
                              + "su - ec2-user -c 'rm -rf /home/ec2-user/outputs && docker pull awiciroh/datastream:routing-only && docker pull awiciroh/forcingprocessor:routing-only && export DS_TAG=routing-only FP_TAG=routing-only && /home/ec2-user/datastreamcli/scripts/routing_only_datastream -s DAILY -n 4 --FORCING_SOURCE NWM_V3_CHRTOUT_SHORT_RANGE_22 -d /home/ec2-user/outputs -r s3://ciroh-community-ngen-datastream/v2.2_resources/VPU_03W -R https://ciroh-community-ngen-datastream.s3.amazonaws.com/realizations/realization_VPU_03W.json --S3_BUCKET ciroh-community-ngen-datastream --S3_PREFIX outputs/routing_only/v2.2_hydrofabric/ngen.DAILY/short_range/22/VPU_03W'",
                            ]
                          + instance_parameters = {
                              + BlockDeviceMappings = [
                                  + {
                                      + DeviceName = "/dev/xvda"
                                      + Ebs        = {
                                          + VolumeSize = 50
                                          + VolumeType = "gp3"
                                        }
                                    },
                                ]
                              + IamInstanceProfile  = {
                                  + Name = "nrds_prod_ec2_profile"
                                }
                              + ImageId             = "ami-0f8e27ecfe91ffd4f"
                              + InstanceType        = "m8g.xlarge"
                              + TagSpecifications   = [
                                  + {
                                      + ResourceType = "instance"
                                      + Tags         = [
                                          + {
                                              + Key   = "Name"
                                              + Value = "prod_routing_only_short_range_VPU03W_init22"
                                            },
                                          + {
                                              + Key   = "Project"
                                              + Value = "routing_only_short_range_VPU_03W"
                                            },
                                        ]
                                    },
                                  + {
                                      + ResourceType = "volume"
                                      + Tags         = [
                                          + {
                                              + Key   = "Name"
                                              + Value = "prod_routing_only_short_range_VPU03W_init22_vol"
                                            },
                                        ]
                                    },
                                ]
                            }
                          + run_options         = {
                              + ii_cheapo             = true
                              + ii_check_s3           = true
                              + ii_delete_volume      = true
                              + ii_terminate_instance = true
                              + n_retries_allowed     = 2
                              + timeout_s             = 3600
                            }
                        }
                    )
                  + Name            = "routing_only_short_range_vpu03W_init22_<aws.scheduler.execution-id>"
                  + StateMachineArn = "arn:aws:states:us-east-1:879381264451:stateMachine:nrds_prod_sm"
                }
            )
          + role_arn = "arn:aws:iam::879381264451:role/nrds_prod_scheduler_role"
        }
    }

  # module.routing_only_schedules.aws_scheduler_schedule.datastream_schedule_short_range_routing_only["23_03W"] will be created
  + resource "aws_scheduler_schedule" "datastream_schedule_short_range_routing_only" {
      + arn                          = (known after apply)
      + group_name                   = "default"
      + id                           = (known after apply)
      + name                         = "short_range_fcst23_vpu03W_schedule_routing_only_prod"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 0 * * ? *)"
      + schedule_expression_timezone = "America/New_York"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:sfn:startExecution"
          + input    = jsonencode(
                {
                  + Input           = jsonencode(
                        {
                          + commands            = [
                              + "su - ec2-user -c 'rm -rf /home/ec2-user/outputs && docker pull awiciroh/datastream:routing-only && docker pull awiciroh/forcingprocessor:routing-only && export DS_TAG=routing-only FP_TAG=routing-only && /home/ec2-user/datastreamcli/scripts/routing_only_datastream -s DAILY -n 4 --FORCING_SOURCE NWM_V3_CHRTOUT_SHORT_RANGE_23 -d /home/ec2-user/outputs -r s3://ciroh-community-ngen-datastream/v2.2_resources/VPU_03W -R https://ciroh-community-ngen-datastream.s3.amazonaws.com/realizations/realization_VPU_03W.json --S3_BUCKET ciroh-community-ngen-datastream --S3_PREFIX outputs/routing_only/v2.2_hydrofabric/ngen.DAILY/short_range/23/VPU_03W'",
                            ]
                          + instance_parameters = {
                              + BlockDeviceMappings = [
                                  + {
                                      + DeviceName = "/dev/xvda"
                                      + Ebs        = {
                                          + VolumeSize = 50
                                          + VolumeType = "gp3"
                                        }
                                    },
                                ]
                              + IamInstanceProfile  = {
                                  + Name = "nrds_prod_ec2_profile"
                                }
                              + ImageId             = "ami-0f8e27ecfe91ffd4f"
                              + InstanceType        = "m8g.xlarge"
                              + TagSpecifications   = [
                                  + {
                                      + ResourceType = "instance"
                                      + Tags         = [
                                          + {
                                              + Key   = "Name"
                                              + Value = "prod_routing_only_short_range_VPU03W_init23"
                                            },
                                          + {
                                              + Key   = "Project"
                                              + Value = "routing_only_short_range_VPU_03W"
                                            },
                                        ]
                                    },
                                  + {
                                      + ResourceType = "volume"
                                      + Tags         = [
                                          + {
                                              + Key   = "Name"
                                              + Value = "prod_routing_only_short_range_VPU03W_init23_vol"
                                            },
                                        ]
                                    },
                                ]
                            }
                          + run_options         = {
                              + ii_cheapo             = true
                              + ii_check_s3           = true
                              + ii_delete_volume      = true
                              + ii_terminate_instance = true
                              + n_retries_allowed     = 2
                              + timeout_s             = 3600
                            }
                        }
                    )
                  + Name            = "routing_only_short_range_vpu03W_init23_<aws.scheduler.execution-id>"
                  + StateMachineArn = "arn:aws:states:us-east-1:879381264451:stateMachine:nrds_prod_sm"
                }
            )
          + role_arn = "arn:aws:iam::879381264451:role/nrds_prod_scheduler_role"
        }
    }

Plan: 25 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + routing_only_short_range_schedule_count = 24

```

</details>

*Pusher: @harshavemula-ua, Action: `pull_request`, Workflow: `Terraform PR Validation`*